{"topics": [
{"file": "9b605d096887459c9c2200e434471cc9.html",
"title": "Welcome to SPLASH Help",
"shortdesc": ""},
{"file": "4bc796d66b4d4c3a86c6ef719983d7b3.html",
"title": "Get Started with Splash",
"shortdesc": "SAP Splash is a UX service that provides design and user experience best practices, tools, and e-learning to organizations looking to implement a design-led and user-centered approach to innovation."},
{"file": "4034a659577d4d5fa725af4c3525eb2d.html",
"title": "What is SPLASH?",
"shortdesc": "SPLASH is a UX service that provides design and user experience best practices, tools, and e-learning to organizations looking to implement a design-led and user-centered approach to innovation."},
{"file": "22d521ddbd854816b8ccb0f0c6a1de34.html",
"title": "Create SPLASH User",
"shortdesc": "To access more advanced features, you should sign up for a SPLASH account . You may have limited access to some features until your admin sets permissions for you."},
{"file": "ff3b78d534e64823a40115440fa7b74c.html",
"title": "Set Your Profile",
"shortdesc": "You can add contact information, your photo, and change your password on the Profile page. You can also resend the verification email, if you did not receive it."},
{"file": "aebea8d795a243a2bf086eb4f9702873.html",
"title": "Projects",
"shortdesc": ""},
{"file": "cd39ba0241a14201b5eac4fa514c6d9b.html",
"title": "Create a New Project",
"shortdesc": "You create a new projects from the Home page displayed when you sign in on the SPLASH landing page."},
{"file": "e800da46fc234457b5d82b1dd166a43a.html",
"title": "Create a Project by Cloning",
"shortdesc": "You can create new projects by cloining projects created and shared by other SPLASH users. You can do this from your SPLASHHOME page."},
{"file": "f7ce9fba7a79424d8ab09e08679dec46.html",
"title": "Add a Project Picture",
"shortdesc": "As project owner you can display a picture on the project tile. Adding a unique picture to each of your project thumbnails makes it easier to identify the project at a glance, and lends your project an impressive visual identity."},
{"file": "9f439111a52240068ea040c67a96390f.html",
"title": "Archive Projects",
"shortdesc": "As owner of a project you can archive and restore a project on the Project page. It is not possible to modify archived projects. You can restore archived projects anytime."},
{"file": "f02d25988f2e4cccb55ac88920a26379.html",
"title": "Restore Archived Projects",
"shortdesc": "You can restore archived projects anytime."},
{"file": "9cefe17d8669496bb7761b6039d45b77.html",
"title": "Project Teams",
"shortdesc": "You can create a team for your project by inviting colleagues to collaborate as project team members. A thumbnail for each member of the project team are displayed in the Project Team section of the Project page. You can also be invited to become a team member of other SPLASH users' projects."},
{"file": "7f8e18a64838478e92157c2e9980aecb.html",
"title": "Invite Team Members",
"shortdesc": "You can invite your colleagues to join a project you created or projects you are a team member of."},
{"file": "ace392f57eea411c8cecc43fac48de4c.html",
"title": "Accept an Invitation",
"shortdesc": "You are invited to join SPLASH projects by email or, if you have opted out of receiving email notifications from SPLASH, a link is displayed on your SPLASH Home page."},
{"file": "15ec191840a3431db95f2e64653fd2c6.html",
"title": "Change Project Owners",
"shortdesc": "The current owner of a project can make any member of a project an owner. Only project owners can archive projects."},
{"file": "5bff4edf493d4d06b64d5b6c953a76bd.html",
"title": "Remove Project Team Members",
"shortdesc": ""},
{"file": "998be77addc74c38988ee396f25036c6.html",
"title": "Gallery Overview",
"shortdesc": "The Gallery displays projects that other Splash users have posted. You can access the Gallery from the Splash landing page, and search for specific projects using keywords. Users can publish projects to the Gallery for other users to view, like, or clone."},
{"file": "9c94c5c7783b4ffb8beabea585068060.html",
"title": "Access the Gallery",
"shortdesc": "You can access the Gallery from the SPLASH landing page in three different ways: the Gallery tab, the interactive image, and by using the scroll bar."},
{"file": "efac7af25102415298fc1bf246624557.html",
"title": "Search Gallery for Projects",
"shortdesc": "You can search the Gallery for projects by applying tags that filter projects. By default, the projects displayed in the Gallery are sorted as most recent."},
{"file": "8abe1732e6eb46aeb2b987937472dfed.html",
"title": "Project Thumbnail",
"shortdesc": "In the Gallery, each project thumbnail shows you a snapshot of the project. You can see the project's picture, short description, associated tags, and how many likes and views the project has."},
{"file": "508abb7903e24f4399fd6ef45da93f0b.html",
"title": "Clone a Project",
"shortdesc": "SPLASH users can make their projects available on the Gallery page for viewing and cloning by other SPLASH users. You may clone a project because you want to use only a single page or single project asset, or because you want to use entire prototype, it's up to you. For more information see the link below."},
{"file": "821343eec86945f0b01980286f1fcdb2.html",
"title": "Prototype Pages",
"shortdesc": "Create realistic and interactive protoype pages in the Prototype tool with the UI Editor and Data Editor."},
{"file": "5b0e553faf4b4d8282d5d4df64409c19.html",
"title": "Prototype Tool",
"shortdesc": "The Prototype Tool that enables you to easily and quickly create interactive prototypes for your application without writing a single line of code. The Prototype Tool includes the UI Editor and the Data Editor."},
{"file": "4c4c7aed7b874f02a220d42a6492e586.html",
"title": "User Interface Editor",
"shortdesc": "The User Interface (UI) Editor is in the Prototype Tool. Use the UI Editor to create interactive prototypes."},
{"file": "4075ea1a342248a59f95e034867c4a3d.html",
"title": "Tool Picker",
"shortdesc": "The Tool Picker is a quick way to switch between the Prototype, Research, and Files tools."},
{"file": "dcc0659146af4d40a5c31850aa719fb4.html",
"title": "Controls Tab",
"shortdesc": "The UI Editor includes built-in Open UI5 UI controls you can use to make prototypes interactive without writing any code."},
{"file": "0165bfc45aee430aab679c4f9f00890d.html",
"title": "Files Tab",
"shortdesc": "The Files tab in the UI Editor lists all the images in your project."},
{"file": "d2f0fca4df53462aa4cc91e5627e36d2.html",
"title": "Data tab",
"shortdesc": "The Data tab in the UI Editor takes you to the Data Editor to create and bind data, and to import sample data for a more realistic prototype."},
{"file": "ae9bf80e468242d89d8cdab375b97ce6.html",
"title": "Tree View",
"shortdesc": "In the UI Editor, the Tree view is an outline of your prototype contents, including controls, pages, and images."},
{"file": "866432f9ba0244a1b7ccc885d9986ff3.html",
"title": "Canvas",
"shortdesc": "The Prototype tool includes a workspace called the canvas in the center of the UI Editor."},
{"file": "4466fc7ceb3c423ebb75e7138346442b.html",
"title": "Toolbar",
"shortdesc": "The UI Editor toolbar includes various options to customize your prototype and canvas view."},
{"file": "828c589f2f2240c79aa70050d41e6bdd.html",
"title": "Properties",
"shortdesc": "Each UI control has properties that you can customize for your prototype. Properties include how the control looks and behaves."},
{"file": "49c71ea748f3483e8471fe30eb67ae51.html",
"title": "Actions",
"shortdesc": "Actions describe what the UI control does, the actions you want the control to have when the user interacts with the control."},
{"file": "6ee08ced939c41228d9365e22c38fd8e.html",
"title": "Add Prototype Pages",
"shortdesc": "The UI Editor in the Prototype tool allows you to quickly create various types of prototype pages to meet your specific needs."},
{"file": "207b4ad88b6e434e8abec9d2ea85b54c.html",
"title": "Add Blank Pages",
"shortdesc": "The UI Editor in the Prototype tool allows you to quickly create prototype pages. Add a blank (or freeform) page to create your own unique, customized prototype page."},
{"file": "a4a70da6daaf410793a3b190af715e06.html",
"title": "Add Responsive Pages",
"shortdesc": "The UI Editor in the Prototype tool allows you to quickly create responsive pages. Add a responsive page to build cross-platform apps in a responsive page layout for use on various formats, phone, tablet, and desktop. Responsive pages automatically arrange controls on the canvas for the appropriate device."},
{"file": "55122dc79fa344958b982eb98f21ef2e.html",
"title": "Add UI Controls",
"shortdesc": "The UI Editor includes many built-in UI controls to make prototypes interactive. Drag and drop controls to the canvas, and apply properties and actions to customize their function."},
{"file": "b25bf189d54a40f08e5c068d91ab6998.html",
"title": "Page Map View",
"shortdesc": "Use the page map view to see thumbnail images and interactions between your prototype pages."},
{"file": "6d3271497b104e889b1598c0819b03f9.html",
"title": "Preview Prototype",
"shortdesc": "Preview your prototype pages and test out the interactions before you publish or share with others."},
{"file": "c076a332263d418b9c1f5e1403f4e2c3.html",
"title": "Publish Prototype",
"shortdesc": "You can publish a prototype at any time and share it with others. This creates a snapshot of the prototype design."},
{"file": "aef003c53d78405da2568426321d0adc.html",
"title": "Web IDE",
"shortdesc": "SAP Web IDE is a web-based tool that enables you to create and extend end user applications for browser and mobile devices."},
{"file": "1dc97d8e83454fe593cd076de414d818.html",
"title": "Extend Prototypes with SAP Web IDE",
"shortdesc": "SAP Web IDE is a web-based tool that enables you to create and extend end user applications for browser and mobile devices. It simplifies the end-to-end application life cycle: prototyping, development, packaging, deployment, and customer extensions for SAPUI5 applications."},
{"file": "b05394b2804646fb999235e872e92f34.html",
"title": "Run Prototype in Web IDE",
"shortdesc": "To use Web IDE with BUILD prototypes, you must first set run configurations in Web IDE."},
{"file": "b02f509d805e428e9b282af43638312c.html",
"title": "Smart Templates",
"shortdesc": "Smart templates help you design powerful prototypes that can handle large amounts of data. The Smart Template List Report Page allows you to prototype a FIORI application leveraging smart-template technology."},
{"file": "2ca07ac8d7f740b2b06b7f538876767a.html",
"title": "Smart Template List Report Page",
"shortdesc": "The List Report is the first page of a smart template prototype and is used to filter a few dedicated objects from a large set of objects. The List Report contains a filter bar above a table."},
{"file": "aa70dab8b9404f63a6bb48e9302c1a24.html",
"title": "Control Properties in the Smart Template List Report Template",
"shortdesc": "This table summarizes how properties are displayed in the property pane:"},
{"file": "27a02e3d3901408a8bee0caed946f398.html",
"title": "Smart Template Object Page",
"shortdesc": "The Object Page displays all relevant information about an object. The Object Page template contains a header and a collection of sections."},
{"file": "cb4e6868f03f4ff78f15cf94ea55f046.html",
"title": "Control Properties in the Smart Template Object Page Template",
"shortdesc": "This table summarizes how properties are displayed in the property pane:"},
{"file": "2cac4d3bd97144ad851e0f4cb40dde3d.html",
"title": "Create Smart Template Pages",
"shortdesc": "Now that you are familiar with the interface, you are ready to use the Smart Templates to create a list report and object pages."},
{"file": "f2b5db9eaa2546fc97c9c169a7354e71.html",
"title": "Add a Smart Template List Report",
"shortdesc": "The List Report is the first page of a smart template prototype and is used to filter a few dedicated objects from a large set of objects. The List Report contains a filter bar above a table."},
{"file": "06de5980f994489193faaf75bab78ebf.html",
"title": "Configure the Smart Template List Report",
"shortdesc": "This section describes how to add and configure elements for the list report."},
{"file": "67ca77a7f8104ff69996ffb6384aaeef.html",
"title": "Add and Configure a Smart Template Object Page",
"shortdesc": "The object page of a smart template contains information about a specific object."},
{"file": "f6f6139cd98747ce80e00201519ba9a0.html",
"title": "Add Another Object Page",
"shortdesc": "Once you have configured the first level of object pages, you can continue to a lower level of the data model."},
{"file": "8979ed19908b4937a436d68030ed4207.html",
"title": "Edit Data",
"shortdesc": "The Edit mode lets you make changes in an object page without making changes in the data model."},
{"file": "23c2d452a7944cdfbb130f577156e3fa.html",
"title": "Binding",
"shortdesc": "Every page, whether it is a list report or an object page, has its main object."},
{"file": "b4524d2cfe4c4935bce6a5ae506d7edb.html",
"title": "Use Images with Smart Templates",
"shortdesc": "You can use images with Smart Template Object Pages to make them more pertinent or attractive."},
{"file": "826edca4a27f417aa944f45d97632eca.html",
"title": "Data Models and the Data Editor",
"shortdesc": "A data model defines the structure of data and its relationships. The model is graphically displayed on-screen in the Data Editor."},
{"file": "c0b4d52243c84c8f96d068157ac4e317.html",
"title": "Add Objects to a Data Model Manually",
"shortdesc": "This section describes how to add objects to a data model manually."},
{"file": "2cae8a4e5b31463caa17bb8da9ee6ab4.html",
"title": "Relationships Between Two Objects",
"shortdesc": "You create relationships from a selected object to a target object."},
{"file": "888443ab71914d69b33f7dc2b83ecb7f.html",
"title": "Create Relationships Between Objects",
"shortdesc": "After you add objects to the data model, you need to create relationships between the objects."},
{"file": "d0df71648c624df6888df90adef9017f.html",
"title": "Edit a Relationship",
"shortdesc": "You can edit a relation from the Relations tab in the right side panel of the Data Editor."},
{"file": "a7a38ff657d742b88e472eef35679535.html",
"title": "Rules for the Object Name",
"shortdesc": "You need to follow these rules when naming objects:"},
{"file": "f81667ffefdd457cbfcc6ab467767631.html",
"title": "Add Objects by Search",
"shortdesc": "You can add objects from business catalogs by using the Search feature."},
{"file": "a24ab97bac464838be931ac9ea0f00e9.html",
"title": "Add Objects from Excel",
"shortdesc": "You can add objects or an entire data model from an Excel spreadsheet."},
{"file": "505c95b8c8354630929fe772478daadf.html",
"title": "Rules for Adding Objects or Importing from a Spreadsheet",
"shortdesc": "When adding objects or importing from Excel you need to follow these rules::"},
{"file": "fe036c222d8d4246ab462fcda420678f.html",
"title": "Use Sample Files to Create a Data Model",
"shortdesc": "We have provided you with one or more sample Excel files to help you create data models from a spreadsheet."},
{"file": "c125ab9850824c77abf96c12655347da.html",
"title": "Add Properties to an Object",
"shortdesc": "You can add properties to an object from the Properties panel on the right side of the editor."},
{"file": "dc6dc55e53324f93b78920562c31eae9.html",
"title": "Create a Calculated Property",
"shortdesc": "You can create a formula for a propertybased on the property, a value, an operator, and a condition. This new property is a calculated property."},
{"file": "90c73651dd2d4d5a9a57868c266c506b.html",
"title": "Editing Data Under the Samples Tab",
"shortdesc": "You can add or modify data by editing it directly in the application or by importing or exporting files to and from an Excel spreadsheet. These actions are performed under the Samples tab."},
{"file": "0c65bdb63e634bc29165ec037ee108f8.html",
"title": "Editing Data in the Data Modeler",
"shortdesc": "You can edit data in the Data Editor using the Samples tab."},
{"file": "0152b6f646ae44938ee15baa257d05d7.html",
"title": "Importing and Exporting Sample Data",
"shortdesc": "BUILD allows you to import data for existing objects and export objects and models to a spreadsheet from the Samples tab."},
{"file": "85b8e56746b94fdc80849a972590edac.html",
"title": "Example Workflows",
"shortdesc": "The following are example workflows."},
{"file": "3fd6a823780d46f59d24dfeae55d4666.html",
"title": "Example: Manually Adding an Object to a Data Model",
"shortdesc": "You have generated a data model from an Excel file and now you want to add an object manually."},
{"file": "3fd1a48d6b2848b0861dcde3e72fdfa3.html",
"title": "Example: Adding Properties to an Object",
"shortdesc": "In this example, you add properties to the object that you have just created."},
{"file": "e3164fb93adc4c59af431aed773129b7.html",
"title": "Example: Manually Adding Data",
"shortdesc": "You can add data to an object in your data model manually"},
{"file": "fbe04e60402c475c9dbe488338b00f51.html",
"title": "Example: Exporting a Modified Model",
"shortdesc": "In the previous example workflow, you edited data in an object. In this workflow, you export the model to Excel."},
{"file": "a425c98658cb4eb6a601ac6dc17c5fe8.html",
"title": "Project Files",
"shortdesc": "You can upload image, document, media files, and HTML prototypes to your project on the Files tool page. You can use these in your project when creating a protoype, creating user studies, and adding a project picture."},
{"file": "36a8f8e406434fcc983ec219a6786f3a.html",
"title": "Upload Files",
"shortdesc": "You can upload files on theFiles tool page. These files can be used in the project when creating prototypes, creating feedback studies, and adding project pictures. You can upload multiple files simultaneously. If you add files to the prototype or to feedback studies in the project they are automatically displayed on the FILES tool page."},
{"file": "bc00a4be620646caabea0f24bb8f178f.html",
"title": "Feedback Studies",
"shortdesc": "The SPLASH Feedback tool lets you create and share feedback studies to gather detailed feedback from people about images, project pages, or interactive HTML prototype applications."},
{"file": "6d92f5cf1d16402c9dec4fd511b96f67.html",
"title": "Create Feedback Studies",
"shortdesc": "You can create multiple feedback studies in each project. First you add a name and description of the study. You add images to the study, and then add questions about those images for participants to answer. You can add HTML prototypes to the study, and create tasks for participants to complete using the prototypes. Then you publish the study and invite people to take partl."},
{"file": "a59810d9d5844484b2c22c79f280fa9e.html",
"title": "Create a Task",
"shortdesc": "To add a task to a feedback study, you upload an interactive prototype, select Start and Target pages, and enter some guidance for users to follow. You can add as many prototypes in a single study, and set a different task for each. You can set multiple tasks on a single prototype by uploading the same prototype multiple times. For each task study participants will interact with the prototype and, based on the user guidance, select the I Have Finished This Task button when they have displayed the Target page. "},
{"file": "25dbf99cedb94d108645efa99946f39d.html",
"title": "Ask a Question",
"shortdesc": "You can add images to SPLASH feedback studies and ask questions about the images."},
{"file": "d562b443cab1479db864348c035d5041.html",
"title": "Guidelines for Study Names and Descriptions",
"shortdesc": "The name and description of your feedback study is displayed to participants when they open the study-link in their browser. The name and description should help the participants to understand what the study is about, and why they are being asked to participate."},
{"file": "6a58ff4ec83646dc9a7d6a5929faf290.html",
"title": "Preview a Feedback Study",
"shortdesc": "You can preview your feedback study to ensure it is ready before you publish it. SPLASH displays the study preview in a different tab to the tab it displays SPLASH application. The preivewed study is identical to the study displayed to participants and you can enter responses to the previewed study. Reponses to previewed studies are not saved."},
{"file": "1b83a80c2aaf4ab9815074f24489eec2.html",
"title": "Publish a Feedback Study",
"shortdesc": "You publish a feedback study to geneate a unique study-link that you can send to participants."},
{"file": "94de2230395c4f88bf39e019fd79b816.html",
"title": "Invite People to Participate In Feedback Studies",
"shortdesc": "Publishing a feedback study generates a unique study-link that SPLASH emails to people you specify, such as colleagues or end-users, to invite them to participate in your research study."},
{"file": "b001f594c6eb4176a745dd8a5374e395.html",
"title": "Retrieve Study Links",
"shortdesc": "You can retrieve the study-link for an active feedback study at any time after you have created a study."},
{"file": "bf32249e397e48f892101bdf62c6d694.html",
"title": "Participate in Feedback Studies",
"shortdesc": "To particpate in a SPLASH feedback study, participants must receive by email a unique study-link from a team member of the project. The participants open the link in their browser, respond to questions about each image, and attempt to complete each task. If a participant has opted out of receiving email notifications from SPLASH, a study tile for the study is displayed in the Studies I Participate In section on your Projects page, and you select the study tile to participate."},
{"file": "ff3198099bf34e83a02aef250ad74309.html",
"title": "View and Analyze Responses to Feedback Studies",
"shortdesc": "You can view participants' responses to your research studies almost as soon as they enter them. A tile for each user research study is displayed on the Feedback results page. A tile for each active study is displayed on the Project page of the project in which the study was created."},
{"file": "57a330a97a9c46768dad0eac09533993.html",
"title": "Responses on the Research Page",
"shortdesc": "On the Feedback results page, you can display tiles for all Active, Draft, or Archived feedback studies in the project by selecting the relevant tab."},
{"file": "8ab24e480a68476f800648582eaabf43.html",
"title": "Overview of Responses to User Research Studies",
"shortdesc": "The Overview tab on the Feedback results page of active or archived feedback studies provides a summary of high-level quantiative statistics about responses to the study."},
{"file": "fa1a3193c6f443fd8d862158495fc406.html",
"title": "Responses to Tasks and Questions",
"shortdesc": "The Tasks and Questions tab on the Results page of active or archived feedback studies provides high-level statistics about participants' responses to each task and question in the study. You can view the participants' responses and detailed statistics about each task and question by selecting the thumbnail images."},
{"file": "39cc06a344764033ab879da1628628b2.html",
"title": "High-Level Statistics about Tasks",
"shortdesc": "High-level statistics about tasks in a study are displayed on the Tasks and Questions tab on the result page of the active or archived study."},
{"file": "ad4ae2e9205e4b02b6055ceba5b495ab.html",
"title": "High-level Statistics About Questions",
"shortdesc": "High-level statistics about questions with a text answer, multiple-choice answers, and answers in annotations and comments in a study are displayed on the Tasks and Questions tab."},
{"file": "efeed3d454c5458ca58f5aa25c627cf4.html",
"title": "Detailed Statistics about Tasks",
"shortdesc": "On the Results page of your study, you can display participants' responses to a task in a study by selecting the thumbnail of the task on the Tasks and Questions tab."},
{"file": "3b12bd8de7cc4fa680ebadaf1c466bee.html",
"title": "Task Overview",
"shortdesc": "The Task Overview tab of the participants responses to a task displays statistics about task, and detailed statistics about participants' responses to the task."},
{"file": "73c63ec80ff34c839d89dcc6bf8a38c7.html",
"title": "Prototype",
"shortdesc": "The Prototype tab displays the fully-interactive prototype upon which the task was based, and displays participants' responses to each page of the prototype and to the overall task."},
{"file": "b645fd069b5f46c7838c83b648dafb5e.html",
"title": "Statistics",
"shortdesc": "The Statistics tab displays overall statistics about a task, and information about participants who attempted to complete the task. You can export the question data by selecting the Export Question Data link on this page."},
{"file": "2dd738ada2ba44a6a46e75bad453cdcb.html",
"title": "Page Flow",
"shortdesc": "The Page Flow page shows the order in which each study participant displayed the pages in the prototype while attempting to complete the task."},
{"file": "8414cbb9bb27400283704e1b73cc26f3.html",
"title": "Detailed Statistics about Questions",
"shortdesc": "You can view the responses to and statistics about questions in studies by selecting the thumbnail image for questions on the Tasks and Questions tab. The Page Overview tab is displayed by default. You can select the Statistics tab to display statistics about the question."},
{"file": "1b35239af75a4cbd93d503c93f7b91dd.html",
"title": "Participants Page",
"shortdesc": ""},
{"file": "528af720f5a643cba061e6795199e7dc.html",
"title": "Participant Invitation Page",
"shortdesc": "You can invite additional participants at any time from the Feedback participant invitation page. To view this page, select the study tile on the Project page, and select the Participant Inviation tab."},
{"file": "ac63e51755294386ba9ae06542b6329f.html",
"title": "Settings",
"shortdesc": "The project owner can pause or archive feedback studies. The project owner can restart paused or archived studies at anytime."},
{"file": "0827a919eb694e63ae668f2c332402f4.html",
"title": "Pausing Studies",
"shortdesc": "Project owners can pause a study at anytime. If a study is paused it is not possible for participants provide further feedback to archived studies, and the study-link is not longer available"},
{"file": "b240e19ad2b94752a6c51eeec29fd258.html",
"title": "Archiving Studies",
"shortdesc": "Project owners can archive paused studies at anytime. If a study is archived it is not possible for participants provide further feedback to archived studies, and the study-link is not longer available."},
{"file": "358fc85da819432cb850700e65b6d04e.html",
"title": "Restarting Studies",
"shortdesc": "Project owners can restart paused or archived studies at anytime. If a study is restarted it is not possible for participants provide further feedback , and the study-link is available."},
{"file": "357b5d4f0db741aeb18e3193f2bf13d3.html",
"title": "Access Learning and Community Pages",
"shortdesc": "The Learning and Community pages provide educational support, e-learning materials, and an interactive space where you can actively participate and interact with user experience design experts. SPLASH users with no background in user experience design can utilize these resources and apply their knowledge to their app development."},
{"file": "756c0abf4ad74ae7999cc937b0911b7c.html",
"title": "Learning Page Overview",
"shortdesc": "The Learning center supports Splash users by providing them with educational tools regarding the fundamentals of user experience design. You can access the content there to learn more about common user experience design practices through methods, design services, and courses. You can leverage knowledge in the Learning center to build your innovation and accelerate the development process."},
{"file": "3d9fea37998f4260bcd2b0b741b64faf.html",
"title": "Community Page Overview",
"shortdesc": "The Community page is an internal community where SPLASH users can view, search, and participate in topics related to SPLASH and user experience design. Each forum is divided into topics, where you can find and share information and resources on a specific subject."},
{"file": "8c60b9804ac1441c81b2b68315e419e8.html",
"title": "Access Topics",
"shortdesc": "Each forum displays a list of topics that SPLASH users create. You can view the details of each topic by selecting a forum from the Community page."},
{"file": "103b8b6eedf842db87c6551f2f39c211.html",
"title": "Create, Edit, and Delete Topics",
"shortdesc": "Create a topic in any of the Community forums to start a discussion."},
{"file": "06ee1a4f115144cb90c9b7d671abe5a3.html",
"title": "Enterprise Page Overview",
"shortdesc": "SPLASH for your Enterprise is a personalized version of SPLASH which you can customize for your organization. You can manage your own private gallery, choose which learning content you want made available, set your own design guidelines, and decide on your own project management."},
{"file": "200bbb40aa4f449a81440a4244e382c5.html",
"title": "Get Started with Admin Console",
"shortdesc": "As a BUILD Administrator, you need to follow these initial steps before users can use the system. You will receive a Welcome email from the SAP BUILD team with instructions on how to get started as BUILD Administrator."},
{"file": "d1a75c9af7cd4565aaa28fb7ed88b9b2.html",
"title": "Admin Console",
"shortdesc": "The BUILD Admin console allows the BUILD Administrator to manage users, domains, and view audit logs."},
{"file": "0693592c3a614d85bb1a456a515be8be.html",
"title": "View Audit Log",
"shortdesc": "BUILD Admins can use the Admin Console to view and download user audit log files."},
{"file": "1aa707dbf69b425fb9437703ef59b448.html",
"title": "Manage Users",
"shortdesc": "BUILD Administrators can use the Admin Console to view and delete users, and to assign roles."},
{"file": "f310f001528e40f0abab71c9016a78b3.html",
"title": "Set Domain Access",
"shortdesc": "BUILD Administrators can add domains and assign roles and permissions to each domain. Users from these domains can then be assigned roles to access BUILD."},
{"file": "6325b1a535aa42988eb3e6e32d63f746.html",
"title": "Known Issues",
"shortdesc": ""},
{"file": "f6dead872ca54b079b1b7ce4fef5f150.html",
"title": "Release Notes",
"shortdesc": ""},
{"file": "d786f2508b7440e1a8e7104613f30c19.html",
"title": "Legal Notices About Fonts",
"shortdesc": "This product makes use of the Roboto fontface Bower package and the Lato font package authored by Łukasz Dziedzic."}]}