{"topics": [
{"file": "9b605d096887459c9c2200e434471cc9.html",
"title": "Welcome to BUILD Help",
"shortdesc": ""},
{"file": "4bc796d66b4d4c3a86c6ef719983d7b3.html",
"title": "Get Started with BUILD",
"shortdesc": "You made a smart choice to use BUILD as your prototyping tool."},
{"file": "4034a659577d4d5fa725af4c3525eb2d.html",
"title": "What is BUILD?",
"shortdesc": "BUILD is a collaborative design tool that enables non-technical users to create interactive prototypes with realistic sample data, making it easier to capture more accurate user feedback and jump-start development, all while incorporating Drive.SAP capabilities for user research directly in BUILD."},
{"file": "22d521ddbd854816b8ccb0f0c6a1de34.html",
"title": "Create BUILD User",
"shortdesc": "The first time you access BUILD you need to sign up. It's free and easy to do. User access is determined by your BUILD administrator. You may have limited access to some features until your admin sets permissions for you."},
{"file": "ff3b78d534e64823a40115440fa7b74c.html",
"title": "Set Your Profile",
"shortdesc": "You can add contact information, your photo, and change your password on the Profile page. You can also resend the verification email, if you did not receive it."},
{"file": "aebea8d795a243a2bf086eb4f9702873.html",
"title": "Projects",
"shortdesc": ""},
{"file": "cd39ba0241a14201b5eac4fa514c6d9b.html",
"title": "Create Projects",
"shortdesc": "When you use BUILD you are always working on a project. You can create multiple projects in BUILD. In each BUILD project you can create a unique HTML prototype application, invite other colleagues to become contributing team members, and create user research studies specific to the project."},
{"file": "f7ce9fba7a79424d8ab09e08679dec46.html",
"title": "Add a Project Picture",
"shortdesc": "The project owner you can display a picture on the project tile. Adding a unique picture to each of your project tiles makes it easier to identify the project at a glance."},
{"file": "acd4be6268bf4517b94c175c44f92f2a.html",
"title": "Archive Projects",
"shortdesc": "The owner of a project can archive and unarchive a project on the Settings page. It is not possible to modify archived projects."},
{"file": "9cefe17d8669496bb7761b6039d45b77.html",
"title": "Project Teams",
"shortdesc": "You can create a team for your project by inviting colleagues to collaborate as project team members. The member of a project team are displayed in the Project Team section of the Project page. The projects's owner is identified by the crown icon. You can also be invited to become a team member of other BUILD users' projects."},
{"file": "7f8e18a64838478e92157c2e9980aecb.html",
"title": "Inviting Team Members",
"shortdesc": "You can invite your colleagues to join a project you created or projects you are a team member of."},
{"file": "ace392f57eea411c8cecc43fac48de4c.html",
"title": "Accepting an Invitation",
"shortdesc": "You are invited to join BUILD projects via email or via a link on your BUILD home page. You do not have to prevsiouly had a BUILD account, because you can create one. The project is automatically displayed on your BUILD Home page. In addition, an avatar with your name is displayed in the Project Team section on the Project page, which all team members can see."},
{"file": "11f21057c4dc4c35b603ce1801bb4338.html",
"title": "Accept an Invitation",
"shortdesc": "If you are invited to join a BUILD project, a link to the invitation is displayed on your BUILD Home page."},
{"file": "15ec191840a3431db95f2e64653fd2c6.html",
"title": "Changing Project Owners",
"shortdesc": "The current owner of a project can make any member of a project an owner. Only project owners can archive projects."},
{"file": "a425c98658cb4eb6a601ac6dc17c5fe8.html",
"title": "Project Files",
"shortdesc": "You can upload image, document, and media filesBrian, I changed to Files, since that is what the UI says now. Should we include HTML prototype upload here, too?Does it need a separate topic? I'm referencing your instructions from UI composer. you require for a project to the project Files folder. In addition, documents you upload to user research studies are automatically added to the Files folder."},
{"file": "36a8f8e406434fcc983ec219a6786f3a.html",
"title": "Upload Files",
"shortdesc": "Files are added to the project Files folder if you upload them directly from the Files page, or if you add them to the project prototype application or user research studies."},
{"file": "821343eec86945f0b01980286f1fcdb2.html",
"title": "Create Prototype Pages",
"shortdesc": "Create realistic and interactive protoype pages with the BUILD. Then you can add UI controls to make your prototypes interactive."},
{"file": "5b0e553faf4b4d8282d5d4df64409c19.html",
"title": "User Interface Editor",
"shortdesc": "BUILD includes the User Interface (UI) Editor, which enables you to easily and quickly create interactive prototypes, wireframes, and interactive select-through mockups for your application."},
{"file": "4c4c7aed7b874f02a220d42a6492e586.html",
"title": "User Interface Editor Overview",
"shortdesc": "The User Interface Editor includes various tools to enable you to create realistic and interactive prototypes for your app."},
{"file": "dcc0659146af4d40a5c31850aa719fb4.html",
"title": "UI Controls",
"shortdesc": "BUILD includes the Open UI5 UI library controls in the UI Editor. Drag and drop controls to the canvas, and apply properties and actions to customize their function."},
{"file": "21031d4ec7d6400faac1810c73ca1d47.html",
"title": "Page Map",
"shortdesc": "View the Page Map from the UI Editor or from the Project page. The Page Map displays a map view for your project. Page thumbnails and navigation are also represented in the Page Map."},
{"file": "6ee08ced939c41228d9365e22c38fd8e.html",
"title": "Add Pages and Controls",
"shortdesc": ""},
{"file": "207b4ad88b6e434e8abec9d2ea85b54c.html",
"title": "Add Blank Pages",
"shortdesc": "Add pages in the UI Editor to start creating your application. You can add responsive pages for various platforms, blank freestyle pages, or pre-defined template pages to your prototype. Add blank pages to create freestyle prototype pages. Blank indicates an open canvas where you can add whatever you like on the canvas.Shared content with responsive pages. Do conditional text and fix this later."},
{"file": "a4a70da6daaf410793a3b190af715e06.html",
"title": "Add Responsive Pages",
"shortdesc": "Add pages in the UI Editor to start creating your application. Add responsive pages to build cross-platform apps in a responsive page layout for use on various formats, phone, table, and desktop. Responsive pages automatically place controls according to the format (phone, tablet, desktop)."},
{"file": "55122dc79fa344958b982eb98f21ef2e.html",
"title": "Add Controls",
"shortdesc": "Use the UI library controls in the UI Editor to make prototypes interactive. Drag and drop controls to the canvas, and apply properties and actions to customize their function."},
{"file": "c076a332263d418b9c1f5e1403f4e2c3.html",
"title": "Publish Prototype",
"shortdesc": "You can publish a prototype at any time and share it with others. This creates a snapshot of the prototype design."},
{"file": "aef003c53d78405da2568426321d0adc.html",
"title": "Web IDE",
"shortdesc": "SAP Web IDE is a web-based tool that enables you to create and extend end user applications for browser and mobile devices."},
{"file": "1dc97d8e83454fe593cd076de414d818.html",
"title": "Extend Prototypes with SAP Web IDE",
"shortdesc": "SAP Web IDE is a web-based tool that enables you to create and extend end user applications for browser and mobile devices. It simplifies the end-to-end application life cycle: prototyping, development, packaging, deployment, and customer extensions for SAPUI5 applications."},
{"file": "b05394b2804646fb999235e872e92f34.html",
"title": "Run Prototype in Web IDE",
"shortdesc": "To use Web IDE with BUILD prototypes, you must first set run configurations in Web IDE."},
{"file": "b02f509d805e428e9b282af43638312c.html",
"title": "Smart Template Pages",
"shortdesc": "BUILD provides smart templates that help you design screens for your prototype."},
{"file": "2ca07ac8d7f740b2b06b7f538876767a.html",
"title": "List Report Page",
"shortdesc": "The List Report is the first page of a smart template prototype and is used to filter a few dedicated objects from a large set of objects. The List Report contains a filter bar above a table."},
{"file": "aa70dab8b9404f63a6bb48e9302c1a24.html",
"title": "Control Properties in the List Report Template",
"shortdesc": "This table summarizes how properties are displayed in the property pane:"},
{"file": "27a02e3d3901408a8bee0caed946f398.html",
"title": "Object Page",
"shortdesc": "The Object Page displays all relevant information about an object. The Object Page template contains a header and a collection of sections."},
{"file": "cb4e6868f03f4ff78f15cf94ea55f046.html",
"title": "Control Properties in the Object Page Template",
"shortdesc": "This table summarizes how properties are displayed in the property pane:"},
{"file": "23c2d452a7944cdfbb130f577156e3fa.html",
"title": "Binding",
"shortdesc": "Every page, whether it is a list report or an object page, has its main object."},
{"file": "2cac4d3bd97144ad851e0f4cb40dde3d.html",
"title": "Create Smart Template Pages",
"shortdesc": "Now that you are familiar with the interface, you are ready to use the BUILD Smart Templates to create a list report and object pages."},
{"file": "f2b5db9eaa2546fc97c9c169a7354e71.html",
"title": "Add a List Report",
"shortdesc": "Once you have created your project, you can start using the smart templates. Start by adding a list report, and then upload a data model."},
{"file": "06de5980f994489193faaf75bab78ebf.html",
"title": "Configure the List Report",
"shortdesc": "This section describes how to add and configure elements for the list report."},
{"file": "67ca77a7f8104ff69996ffb6384aaeef.html",
"title": "Add an Object Page",
"shortdesc": "After you configure your List Report, you are ready to configure one or more object pages."},
{"file": "f6f6139cd98747ce80e00201519ba9a0.html",
"title": "Add a Second Object Page",
"shortdesc": "Once you have configured the first level of object pages, you can continue to a lower level of the data model."},
{"file": "12677806c9c0461f899ad39099ae6ff7.html",
"title": "Publish the Prototype",
"shortdesc": "After create your list report and object page, you can view your prototype in a browser and share it."},
{"file": "8979ed19908b4937a436d68030ed4207.html",
"title": "Edit Data",
"shortdesc": "The Edit mode lets you make changes in an object page without making changes in the data model."},
{"file": "826edca4a27f417aa944f45d97632eca.html",
"title": "Data Models and the Data Editor",
"shortdesc": "In BUILD, you can create and modify data models to organize data elements in your projects."},
{"file": "8b4c638aaa2f4dada7360a41368cdf55.html",
"title": "Access the Data Editor",
"shortdesc": "This topic describes how to access the Data Editor."},
{"file": "c0b4d52243c84c8f96d068157ac4e317.html",
"title": "Add Objects to a Data Model Manually",
"shortdesc": "This section describes how to add objects to a data model manually."},
{"file": "2cae8a4e5b31463caa17bb8da9ee6ab4.html",
"title": "Relations Between Two Objects",
"shortdesc": "You create relations from a selected object to a target object."},
{"file": "888443ab71914d69b33f7dc2b83ecb7f.html",
"title": "Create Relations Between Objects",
"shortdesc": "After you add objects to the data model, you must create relations between objects."},
{"file": "d0df71648c624df6888df90adef9017f.html",
"title": "Edit a Relation",
"shortdesc": "You can edit a relation from the Relations tab in the right side panel of the Data Editor."},
{"file": "a7a38ff657d742b88e472eef35679535.html",
"title": "Rules for the Object Name",
"shortdesc": "You need to observe several rules when naming objects:"},
{"file": "f81667ffefdd457cbfcc6ab467767631.html",
"title": "Add Objects by Search",
"shortdesc": "You can add objects from business catalogs by using the Search feature."},
{"file": "a24ab97bac464838be931ac9ea0f00e9.html",
"title": "Add Objects from Excel",
"shortdesc": "You can add objects or an entire data model from an Excel spreadsheet."},
{"file": "505c95b8c8354630929fe772478daadf.html",
"title": "Rules for Adding Objects or Importing from a Spreadsheet",
"shortdesc": "When adding objects or importing via Excel you need to respect these following rules:"},
{"file": "fe036c222d8d4246ab462fcda420678f.html",
"title": "Use Sample Files to Create a Data Model",
"shortdesc": "BUILD provides you with sample Excel files to help you create data models from a spreadsheet."},
{"file": "3d344c644c51422fb83fe6233d316acd.html",
"title": "Add Properties to an Object",
"shortdesc": "Add properties to an object from the right side panel in the Data Editor."},
{"file": "dc6dc55e53324f93b78920562c31eae9.html",
"title": "Create a Calculated Property",
"shortdesc": "BUILD allows you to specify a formula for a property. This property is a calculated property."},
{"file": "90c73651dd2d4d5a9a57868c266c506b.html",
"title": "Editing Data Under the Samples Tab",
"shortdesc": "BUILD allows you to modify data by editing it directly in the application or by importing or exporting files to and from an Excel spreadsheet. These actions are performed under the Samples tab."},
{"file": "0c65bdb63e634bc29165ec037ee108f8.html",
"title": "Editing Data in the Data Modeler",
"shortdesc": "You can edit data in the Data Editor using the Samples tab."},
{"file": "0152b6f646ae44938ee15baa257d05d7.html",
"title": "Importing and Exporting Sample Data",
"shortdesc": "BUILD allows you to import data for existing objects and export objects and models to a spreadsheet from the Samples tab."},
{"file": "85b8e56746b94fdc80849a972590edac.html",
"title": "Example Workflows",
"shortdesc": "The following are example workflows."},
{"file": "3fd6a823780d46f59d24dfeae55d4666.html",
"title": "Example: Manually Adding an Object to a Data Model",
"shortdesc": "You have generated a data model from an Excel file and now you want to add an object manually."},
{"file": "3fd1a48d6b2848b0861dcde3e72fdfa3.html",
"title": "Example: Adding Properties to an Object",
"shortdesc": "In this example, you add properties to the object that you have just created."},
{"file": "e3164fb93adc4c59af431aed773129b7.html",
"title": "Example: Manually Adding Data",
"shortdesc": "You can add data to an object in your data model manually"},
{"file": "fbe04e60402c475c9dbe488338b00f51.html",
"title": "Example: Exporting a Modified Model",
"shortdesc": "In the previous example workflows, you have modified data in an object. In this workflow, you export the model to Excel."},
{"file": "bc00a4be620646caabea0f24bb8f178f.html",
"title": "User Research Studies",
"shortdesc": "The BUILD user research module lets you to quickly create and share user research studies to gather detailed feedback from colleagues or end-users about images, project pages, or interactive HTML prototype applications."},
{"file": "6d92f5cf1d16402c9dec4fd511b96f67.html",
"title": "Create User Research Studies",
"shortdesc": "In a project, you create a new research study, and give it a name. You add images to the study, and then add questions about those images for participants to answer. You can add HTML prototypes to the study, and create tasks for participants to complete using the prototypes. Then you publish the study to generate a study-link, which you can send to third parties by email."},
{"file": "a59810d9d5844484b2c22c79f280fa9e.html",
"title": "Create a Task",
"shortdesc": "To add a task to a study, you upload an interactive prototype, select Start and Target pages, and enter some guidance for users to follow. Study participants will interact with the prototype and, based on the user guidance, select the I HAVE FINISHED THIS TASK button when they have displayed the Target page. "},
{"file": "25dbf99cedb94d108645efa99946f39d.html",
"title": "Ask a Question",
"shortdesc": "You can add images to BUILD user research studies and ask questions about the images."},
{"file": "d562b443cab1479db864348c035d5041.html",
"title": "Guidelines for Study Names and Descriptions",
"shortdesc": "The name and description of your user research study is displayed to participants when they open the study-link in their browser. The name and description should help the participants to understand what the study is about, and why they are being asked to participate."},
{"file": "1b83a80c2aaf4ab9815074f24489eec2.html",
"title": "Publish a Study",
"shortdesc": "You publish a study to geneate a unique study-link URL that you can send to participants."},
{"file": "94de2230395c4f88bf39e019fd79b816.html",
"title": "Invite People to Participate In User Research Studies",
"shortdesc": "Publishing a research study generates a unique URL that you email to people, such as colleagues or end-users, to invite them to participate in your research study."},
{"file": "b001f594c6eb4176a745dd8a5374e395.html",
"title": "Retrieve Study Links",
"shortdesc": "You can retrieve the study-link for an active user research study at any time after you have created a study."},
{"file": "bf32249e397e48f892101bdf62c6d694.html",
"title": "Participate in User Research Studies",
"shortdesc": "To particpate in a BUILD user research study, participants must receive by email a unique BUILD user research study-link URL by the study-creator or a team member of the project. The participants open the link in their browser, respond to questions about each image, and attempt to complete each task. If you have opted out of receiving email notifications from BUILD, a study tile for the study is displayed in the Studies I Participate In section on your Projects page, and you select the study tile to participate."},
{"file": "ff3198099bf34e83a02aef250ad74309.html",
"title": "View and Analyze Responses to User Research Studies",
"shortdesc": "You can view participants' responses to your research studies almost as soon as they enter them. A tile for each user research study is displayed on the Research page. A tile for each active study is displayed on the Project page of the project in which the study was created."},
{"file": "57a330a97a9c46768dad0eac09533993.html",
"title": "Responses on the Research Page",
"shortdesc": "On the Research page, you can display tiles for all Active, Draft, or Archived user research studies in the project by selecting the relevant tab."},
{"file": "8ab24e480a68476f800648582eaabf43.html",
"title": "Overview of Responses to User Research Studies",
"shortdesc": "The Overview tab on the Results page of active or archived user research studies provides a summary of high-level quantiative statistics about responses to the study."},
{"file": "fa1a3193c6f443fd8d862158495fc406.html",
"title": "Responses to Tasks and Questions",
"shortdesc": "The Tasks and Questions tab on the Results page of active or archived studies provides high-level statistics about participants' responses to each task and question in the study. You can view the participants' responses and detailed statistics about each task and question by selecting the thumbnail images."},
{"file": "39cc06a344764033ab879da1628628b2.html",
"title": "High-Level Statistics about Tasks",
"shortdesc": "High-level statistics about tasks in a study are displayed on the Tasks and Questions tab on the result page of the active or archived study."},
{"file": "ad4ae2e9205e4b02b6055ceba5b495ab.html",
"title": "High-level Statistics About Questions",
"shortdesc": "High-level statistics about questions with a text answer, multiple-choice answers, and answers in annotations and comments in a study are displayed on the Tasks and Questions tab."},
{"file": "efeed3d454c5458ca58f5aa25c627cf4.html",
"title": "Detailed Statistics about Tasks",
"shortdesc": "On the Results page of your study, you can display participants' responses to a task in a study by selecting the thumbnail of the task on the Tasks and Questions tab."},
{"file": "3b12bd8de7cc4fa680ebadaf1c466bee.html",
"title": "Task Overview",
"shortdesc": "The Task Overview tab of the participants responses to a task displays statistics about task, and detailed statistics about participants' responses to the task."},
{"file": "73c63ec80ff34c839d89dcc6bf8a38c7.html",
"title": "Prototype",
"shortdesc": "The Prototype tab displays the fully-interactive prototype upon which the task was based, and displays participants' responses to each page of the prototype and to the overall task."},
{"file": "b645fd069b5f46c7838c83b648dafb5e.html",
"title": "Statistics",
"shortdesc": "The Statistics tab displays overall statistics about a task, and information about participants who attempted to complete the task. You can export the question data by selecting the Export Question Data link on this page."},
{"file": "2dd738ada2ba44a6a46e75bad453cdcb.html",
"title": "Page Flow",
"shortdesc": "The Page Flow page shows the order in which each study participant displayed the pages in the prototype while attempting to complete the task."},
{"file": "8414cbb9bb27400283704e1b73cc26f3.html",
"title": "Detailed Statistics about Questions",
"shortdesc": "You can view the responses to and statistics about questions in studies by selecting the thumbnail image for questions on the Tasks and Questions tab. The Page Overview tab is displayed by default. You can select the Statistics tab to display statistics about the question."},
{"file": "1b35239af75a4cbd93d503c93f7b91dd.html",
"title": "Participants Page",
"shortdesc": ""},
{"file": "528af720f5a643cba061e6795199e7dc.html",
"title": "Participant Invitation Page",
"shortdesc": "You can invite additional participants at any time from the Participant Invitation page. To view this page, select the study tile on the Research page, and select the Participant Inviation tab."},
{"file": "ac63e51755294386ba9ae06542b6329f.html",
"title": "Settings",
"shortdesc": "The project owner can pause or archive project research studies. The project owner can restart paused or archived studies at anytime."},
{"file": "0827a919eb694e63ae668f2c332402f4.html",
"title": "Pausing Studies",
"shortdesc": "Project owners can pause a study at anytime."},
{"file": "b240e19ad2b94752a6c51eeec29fd258.html",
"title": "Archiving Studies",
"shortdesc": "Project owners can archive paused studies at anytime."},
{"file": "358fc85da819432cb850700e65b6d04e.html",
"title": "Restarting Studies",
"shortdesc": "Project owners can restart paused or archived studies at anytime."},
{"file": "200bbb40aa4f449a81440a4244e382c5.html",
"title": "Get Started with Admin Console",
"shortdesc": "As a BUILD Administrator, you need to follow these initial steps before users can use the system. You will receive a Welcome email from the SAP BUILD team with instructions on how to get started as BUILD Administrator."},
{"file": "d1a75c9af7cd4565aaa28fb7ed88b9b2.html",
"title": "Admin Console",
"shortdesc": "The BUILD Admin console allows the BUILD Administrator to manage users, domains, and view audit logs."},
{"file": "0693592c3a614d85bb1a456a515be8be.html",
"title": "View Audit Log",
"shortdesc": "BUILD Admins can use the Admin Console to view and download user audit log files."},
{"file": "1aa707dbf69b425fb9437703ef59b448.html",
"title": "Manage Users",
"shortdesc": "BUILD Administrators can use the Admin Console to view and delete users, and to assign roles."},
{"file": "f310f001528e40f0abab71c9016a78b3.html",
"title": "Set Domain Access",
"shortdesc": "BUILD Administrators can add domains and assign roles and permissions to each domain. Users from these domains can then be assigned roles to access BUILD."},
{"file": "d786f2508b7440e1a8e7104613f30c19.html",
"title": "Legal Notice About Fonts",
"shortdesc": "This product (ie BUILD) makes use of the Roboto fontface Bower package authored by Christian Hoffmeister and made available through GtiHub under the terms of the Apache Software License, v.2. The Roboto fontface Bower package is based on the Roboto font package authored by Christian Robertson and made available through Google Fonts under the terms of the Apache Software License, v. 2. (see below)"}]}